app/admin/friends.rb

      f.semantic_errors

      #f.select :email, User.all.map{|u| [u.email, u.email][u.id, u.id]}
      f.select :email, User.order(:email).pluck(:id)
       f.select :email, options_for_select(User.all.map{|u| [u.email, u.id.to_s]})
---
SELECT "users"."id" FROM "users" ORDER BY "users"."email" ASC