app/admin/users.rb

end

show title: :first_name  do
  h3 'This user has '+ pluralize(user.friends.count, 'friend')
  user.friends.each do |friend|
---
SELECT COUNT(*) FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 10]]
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 10]]