app/controllers/friends_controller.rb

SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 10]]
---
  def index
    if user_signed_in?
    @friends = current_user.friends
  else
    @friends = Friend.all

INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "instagram", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    #@friend = Friend.new(friend_params)
    @friend= current_user.friends.build(friend_params)

    respond_to do |format|
      if @friend.save

UPDATE "friends" SET "last_name" = ?, "email" = ?, "phone" = ?, "instagram" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["last_name", "Tiwari"], ["email", "aditi@shubham.com"], ["phone", "9648336948"], ["instagram", "@loveshubham"], ["updated_at", "2023-01-06 08:05:54.071403"], ["id", 21]]
---
  def update
    respond_to do |format|
      if @friend.update(friend_params)